Revit 2027 API
StructuralConnectionType.ApplyTo Property
 Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralConnectionApplyTo ApplyTo { get; }
Public ReadOnly Property ApplyTo As StructuralConnectionApplyTo
	Get
public:
property StructuralConnectionApplyTo ApplyTo {
	StructuralConnectionApplyTo get ();
}
member ApplyTo : StructuralConnectionApplyTo with get
Property Value
StructuralConnectionApplyTo
Remarks
 The property cannot be changed. Create a new StructuralConnectionType if a different value is needed.
See Also
Reference
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace